<center>
<img src="ods_stickers.jpg" />
    
## [mlcourse.ai](https://mlcourse.ai) – Open Machine Learning Course 
Author: Arina Lopukhova (@erynn). Edited by [Yury Kashnitskiy](https://yorko.github.io) (@yorko) and Vadim Shestopalov (@vchulski). This material is subject to the terms and conditions of the [Creative Commons CC BY-NC-SA 4.0](https://creativecommons.org/licenses/by-nc-sa/4.0/) license. Free use is permitted for any non-commercial purpose.

# <center>Assignment #1. Fall 2019
## <center>Exploratory data analysis of Olympic games with Pandas
    
<img src='https://nbviewer.jupyter.org/github/Yorko/mlcourse.ai/blob/master/img/olympic_logo.png' width=50%>

Prior to working on the assignment, you'd better check out the corresponding course material:
 - [Exploratory data analysis with Pandas](https://nbviewer.jupyter.org/github/Yorko/mlcourse_open/blob/master/jupyter_english/topic01_pandas_data_analysis/topic1_pandas_data_analysis.ipynb?flush_cache=true), the same as an interactive web-based [Kaggle Kernel](https://www.kaggle.com/kashnitsky/topic-1-exploratory-data-analysis-with-pandas)
 - first lectures in mlcourse.ai [YouTube playlist ](https://www.youtube.com/watch?v=QKTuw4PNOsU&list=PLVlY_7IJCMJeRfZ68eVfEcu-UcN9BbwiX) 
 - you can also practice with demo assignments, which are simpler and already shared with solutions: [A1 demo](https://www.kaggle.com/kashnitsky/a1-demo-pandas-and-uci-adult-dataset), [solution](https://www.kaggle.com/kashnitsky/a1-demo-pandas-and-uci-adult-dataset-solution)

### Your task is to:
 1. write code and perform computations in the cells below
 2. choose answers in the [webform](https://docs.google.com/forms/d/1JxhQ9Bg4OpM3E5N47ZuRbILgDuMRbvEnUbDMZK8L-NU). Solutions will be shared only with those who've filled in this form 
 3. submit answers with some email and **remember it**! This will be your ID during the course. Specify your real full name in the form as well (no nicks allowed in the final top-100 [rating](https://mlcourse.ai/rating)). If in doubt, you can re-submit the form till the deadline for A1, no problem, but stick to only one email.
 
### <center> Deadline for A1: 2019 September 15, 20:59 GMT (London time)
    
You'll get up to 10 credits for this assignment.

### Assignment 
__There are ten questions about 120 years of Olympic history in this task. Your task is to fill in the missing Python code and choose answers in [this web-form](https://docs.google.com/forms/d/1JxhQ9Bg4OpM3E5N47ZuRbILgDuMRbvEnUbDMZK8L-NU).__

Download the file `athlete_events.csv` from [here](https://drive.google.com/file/d/1f5v6Z2ayc7h698FG_98wP5x1Y2zZQeox/view?usp=sharing) (scraped by [rgriffin](https://www.randigriffin.com/) from www.sports-reference.com). The dataset has the following features:

- __ID__ - Unique number for each athlete
- __Name__ - Athlete's name
- __Sex__ - M or F
- __Age__ - Integer
- __Height__ - In centimeters
- __Weight__ - In kilograms
- __Team__ - Team name
- __NOC__ - National Olympic Committee 3-letter code
- __Games__ - Year and season
- __Year__ - Integer
- __Season__ - Summer or Winter
- __City__ - Host city
- __Sport__ - Sport
- __Event__ - Event
- __Medal__ - Gold, Silver, Bronze, or NA

In [1]:
import pandas as pd
import numpy as np

In [2]:
PATH = 'athlete_events.csv'

In [3]:
data = pd.read_csv(PATH)
data.head(5)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [4]:
data.describe()

,ID,Age,Height,Weight,Year
count,271116.000000,261642.000000,210945.000000,208241.000000,271116.000000
mean,68248.954396,25.556898,175.338970,70.702393,1978.378480
std,39022.286345,6.393561,10.518462,14.348020,29.877632
min,1.000000,10.000000,127.000000,25.000000,1896.000000
25%,34643.000000,21.000000,168.000000,60.000000,1960.000000
50%,68205.000000,24.000000,175.000000,70.000000,1988.000000
75%,102097.250000,28.000000,183.000000,79.000000,2002.000000
max,135571.000000,97.000000,226.000000,214.000000,2016.000000

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 15 columns):
ID        271116 non-null int64
Name      271116 non-null object
Sex       271116 non-null object
Age       261642 non-null float64
Height    210945 non-null float64
Weight    208241 non-null float64
Team      271116 non-null object
NOC       271116 non-null object
Games     271116 non-null object
Year      271116 non-null int64
Season    271116 non-null object
City      271116 non-null object
Sport     271116 non-null object
Event     271116 non-null object
Medal     39783 non-null object
dtypes: float64(3), int64(2), object(10)
memory usage: 31.0+ MB

__1. How old were the youngest male and female participants of the 1992 Olympics?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- 16 and 15
- 14 and 13 
- 13 and 11
- **11 and 12** +

In [6]:
res = data[data.Year == 1992]
print(f"{res[res.Sex == 'M'].Age.min()} - yangest male",
      f"{res[res.Sex == 'F'].Age.min()} - yangest female", sep="\n")

11.0 - yangest male
12.0 - yangest female

In [7]:
data.head(1)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN

__2. What was the percentage of male basketball players among all the male participants of the 2012 Olympics? Round the answer to the first decimal.__

*Hint:* here and further if needed drop duplicated sportsmen to count only unique ones. 

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- 0.2
- 1.5 
- **2.5** +
- 7.7

In [35]:
res = data.loc[(data["Year"] == 2012) & (data["Sex"] == "M")]

print(
    round(res[res.Sport == "Basketball"].shape[0] * 100 / res.shape[0], 1),
    " - answer before drop duplicates"
    )

print(res.shape)

res = res.drop_duplicates("ID")
print(res.shape)

print(
    round(res[res.Sport == "Basketball"].shape[0] * 100 / res.shape[0], 1),
    " - answer after drop duplicates"
    )

2.0  - answer before drop duplicates
(7105, 15)
(5863, 15)
2.5  - answer after drop duplicates

____
## <center>   Clean data

In [9]:
clean_data = data.drop_duplicates("ID")

In [10]:
data.Sport.unique()

array(['Basketball', 'Judo', 'Football', 'Tug-Of-War', 'Speed Skating',
       'Cross Country Skiing', 'Athletics', 'Ice Hockey', 'Swimming',
       'Badminton', 'Sailing', 'Biathlon', 'Gymnastics',
       'Art Competitions', 'Alpine Skiing', 'Handball', 'Weightlifting',
       'Wrestling', 'Luge', 'Water Polo', 'Hockey', 'Rowing', 'Bobsleigh',
       'Fencing', 'Equestrianism', 'Shooting', 'Boxing', 'Taekwondo',
       'Cycling', 'Diving', 'Canoeing', 'Tennis', 'Modern Pentathlon',
       'Figure Skating', 'Golf', 'Softball', 'Archery', 'Volleyball',
       'Synchronized Swimming', 'Table Tennis', 'Nordic Combined',
       'Baseball', 'Rhythmic Gymnastics', 'Freestyle Skiing',
       'Rugby Sevens', 'Trampolining', 'Beach Volleyball', 'Triathlon',
       'Ski Jumping', 'Curling', 'Snowboarding', 'Rugby',
       'Short Track Speed Skating', 'Skeleton', 'Lacrosse', 'Polo',
       'Cricket', 'Racquets', 'Motorboating', 'Military Ski Patrol',
       'Croquet', 'Jeu De Paume', 'Roque', 'Alpinism', 'Basque Pelota',
       'Aeronautics'], dtype=object)

___

__3. What are the mean and standard deviation of height for female tennis players who participated in the 2000 Olympics? Round the answer to the first decimal.__


*Каковы среднее и стандартное отклонение роста женщин-теннисисток, участвовавших в Олимпийских играх 2000 года? Округлите ответ до первого десятичного знака после запятой.*

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- **171.8 and 6.5** +
- 179.4 and 10
- 180.7 and 6.7
- 182.4 and 9.1

In [11]:
data.head(1)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN

In [12]:
data.Sex.unique()

array(['M', 'F'], dtype=object)

In [13]:
def task_3(input_data: pd.DataFrame):
    res = input_data.loc[(input_data.Year == 2000) & (input_data.Sport == "Tennis") & (input_data.Sex == "F")].Height
    mean_val = res.mean() 
    std_val = res.std()
    print(f"{round(mean_val, 1)} - mean  \n{round(std_val, 1)} - standart deviation\n")

In [14]:
print("Before cleaning:")
task_3(data)
print("After cleaning:")
task_3(clean_data)

Before cleaning:
171.8 - mean
6.5 - standart deviation

After cleaning:
172.4 - mean
6.4 - standart deviation

__4. Find a sportsman who participated in the 2006 Olympics, with the highest weight among other participants of the same Olympics. What sport did he or she do?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- Judo
- Bobsleigh 
- **Skeleton** +
- Boxing

In [15]:
def task_4(data):
    res = data.loc[data.Year == 2006]
    return res.loc[res.Weight == res.Weight.max()].Sport.values

In [16]:
print(*task_4(data))

Skeleton

__5. How many times did John Aalberg participate in the Olympics held in different years?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- 0
- 1
- 2 +
- 3

In [19]:
def task_5(data):
    return data.loc[data.Name == "John Aalberg"]

In [27]:
len(task_5(data).Year.unique())

2

In [26]:
task_5(clean_data).Year.unique()

array([1992], dtype=int64)

__6. How many gold medals in tennis did sportspeople from the Switzerland team win at the 2008 Olympics? Count every medal from every sportsperson.__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- 0
- 1 
- 2 +
- 3

In [20]:
data.loc[data.Team.str.lower().str.startswith("swi")].shape

(6102, 15)

In [21]:
data.Medal.unique()

array([nan, 'Gold', 'Bronze', 'Silver'], dtype=object)

In [33]:
def task_6(data):
    return data.loc[(data.Year == 2008) & data.Team.str.lower().str.startswith("swi") & (data.Sport == "Tennis") & (data.Medal == "Gold") ].Medal

In [36]:
print([(task_6(x)) for x in (data, clean_data)], sep='\n')

[67290     Gold
257672    Gold
Name: Medal, dtype: object, Series([], Name: Medal, dtype: object)]

__7. Is it true that *Spain* won fewer medals than *Italy* at the 2016 Olympics? Do not consider NaN values in _Medal_ column.__ 

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- **Yes**
- No

In [24]:
count = lambda country, data: data.loc[(data.Year == 2016) & data.Team.str.startswith(country)].Medal.dropna().value_counts()

for x in (data, clean_data):
    print("Yes" if count("Spain", x).sum() < count("Italy", x).sum() else "No")

Yes
Yes

__8. What age category did the fewest and the most participants of the 2008 Olympics belong to?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- [45-55] and [25-35) correspondingly
- **[45-55] and [15-25) correspondingly** +
- [35-45) and [25-35) correspondingly
- [45-55] and [35-45) correspondingly

In [25]:
def age_category(age):
    if age < 15:
        return np.NaN
    if age < 25:
        return 1
    if age < 35:
        return 2
    if age < 45:
        return 3
    if age <= 55:
        return 4
    return np.NaN

In [32]:
def task_8(data):
    a = data.loc[data.Year == 2008].Age.apply(age_category).value_counts()
    return [a[a == func(a)].axes[0][0] for func in (min, max)]

In [33]:
from_cat = {
    1: "[15, 25)",
    2: "[25, 35)",
    3: "[35, 45)",
    4: "[45, 55]",
}
some = lambda x: f"{from_cat[int(x[0])]} - fewest, {from_cat[int(x[1])]} - most"

print("Raw data:", some(task_8(data)), sep='\n')
print()
print("Some cleaned data:", some(task_8(clean_data)), sep="\n")

Raw data:
[45, 55] - fewest, [25, 35) - most

Some cleaned data:
[45, 55] - fewest, [15, 25) - most

__9. Is it true that there were Summer Olympics held in Atlanta? Is it true that there were Winter Olympics held in Squaw Valley?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- **Yes, Yes** + 
- Yes, No
- No, Yes 
- No, No

In [28]:
data.head(1)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN

In [29]:
res = lambda season, city: data.loc[(data.Season == season) & data.City.str.lower().str.startswith(city)].empty
print(*[not res(x, y) for x, y in (("Summer", "atlanta"), ("Winter", "squaw valley"))])

True True

__10. What is the absolute difference between the number of unique sports at the 1986 Olympics and 2002 Olympics?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- 3 
- 10
- **15** +
- 27

In [30]:
some = lambda year: len(data.loc[data.Year == year].Sport.unique())
abs(some(1986) - some(2002))

15

In [31]:
data.loc[data.Year == 1986]

Empty DataFrame
Columns: [ID, Name, Sex, Age, Height, Weight, Team, NOC, Games, Year, Season, City, Sport, Event, Medal]
Index: []

That's it! Now go and do 30 push-ups! :)